**Import Necessary Libraries**

In [2]:
import numpy as np
import pandas as pd
import os  
import matplotlib.pyplot as plt
import seaborn as sns

**Merging 12 months sale data**

- create empty dataframe
- read all the data files
- concatinate with the empty dataframe

In [3]:
df = pd.read_csv('./Sales_Data/Sales_March_2019.csv')
files = [file for file in os.listdir('./Sales_Data')]

yearly_data = pd.DataFrame()

for file in files:
    df = pd.read_csv('./Sales_Data/' + file)
    yearly_data = pd.concat([yearly_data, df])

for col_names in yearly_data.columns:
    yearly_data = yearly_data.applymap(lambda x : np.nan if x == col_names else x)

# yearly_data.head()
yearly_data.to_csv('Yearly_data_1.csv', index = False)

**Upload and Read updated dataset**

In [4]:
data = pd.read_csv('Yearly_data_1.csv')
data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558.0,USB-C Charging Cable,2.0,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559.0,Bose SoundSport Headphones,1.0,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560.0,Google Phone,1.0,600.00,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560.0,Wired Headphones,1.0,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

**Checking and Handling Null Values**

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186850 entries, 0 to 186849
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  float64
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  float64
 3   Price Each        185950 non-null  float64
 4   Order Date        185950 non-null  object
 5   Purchase Address  185950 non-null  object
dtypes: float64(3), object(3)
memory usage: 8.6+ MB

**each column has only 0.29% null values so its better to drop them**

In [6]:
(data.isnull().sum()/data.shape[0])*100

Order ID            0.48167
Product             0.48167
Quantity Ordered    0.48167
Price Each          0.48167
Order Date          0.48167
Purchase Address    0.48167
dtype: float64

In [7]:
data.dropna(inplace=True)
data.reset_index(drop=True, inplace=True)

In [8]:
data.isnull().sum()

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
dtype: int64

###EXCE

**In this data analysis project I am going to analyze the data to answer the following questions of the client.**

- what was best month for sale and how much was earned in that month

In [9]:
data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558.0,USB-C Charging Cable,2.0,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,176559.0,Bose SoundSport Headphones,1.0,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
2,176560.0,Google Phone,1.0,600.00,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
3,176560.0,Wired Headphones,1.0,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176561.0,Wired Headphones,1.0,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001"

In [12]:
data['Price Each'].astype(float)
data['Quantity Ordered'].astype(float)

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185950 entries, 0 to 185949
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  float64
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  float64
 3   Price Each        185950 non-null  float64
 4   Order Date        185950 non-null  object
 5   Purchase Address  185950 non-null  object
dtypes: float64(3), object(3)
memory usage: 8.5+ MB

In [15]:
data['Month'] = data['Order Date'].str[0:2].astype(int)

In [23]:
data['Total_Sale'] = data['Quantity Ordered'] * data['Price Each']

In [24]:
data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Total_Sale
0,176558.0,USB-C Charging Cable,2.0,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001",4,23.90
1,176559.0,Bose SoundSport Headphones,1.0,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215",4,99.99
2,176560.0,Google Phone,1.0,600.00,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001",4,600.00
3,176560.0,Wired Headphones,1.0,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001",4,11.99
4,176561.0,Wired Headphones,1.0,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001",4,11.99

In [31]:
data.groupby('Month').sum()['Total_Sale']

C:\Users\Sk\AppData\Local\Temp\ipykernel_17152\2185771766.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  data.groupby('Month').sum()['Total_Sale']

Month
1     1822256.73
2     2202022.42
3     2807100.38
4     3390670.24
5     3152606.75
6     2577802.26
7     2647775.76
8     2244467.88
9     2097560.13
10    3736726.88
11    3199603.20
12    4613443.34
Name: Total_Sale, dtype: float64

Result for challenge 1 - In December client has been made highest sale of 4613443.34